<a href="https://colab.research.google.com/github/rizwanahmed2022/DS-google-colab/blob/main/imputation_Assignment_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd
url = "https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv"
df = pd.read_csv(url)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [4]:
mv = df.isnull().sum()
print(mv)

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [5]:
# Find median age of males and females
male_age = df[df['Sex'] == 'male']['Age'].median()
female_age = df[df['Sex'] == 'female']['Age'].median()

# Fill missing ages for males and females separately
df.loc[(df['Age'].isnull()) & (df['Sex'] == 'male'), 'Age'] = male_age
df.loc[(df['Age'].isnull()) & (df['Sex'] == 'female'), 'Age'] = female_age

In [7]:
# Get the title like Mr, Mrs, Miss, Master from the Name column
df['Title'] = df['Name'].apply(lambda x: x.split(',')[1].split('.')[0].strip())

In [8]:
df['Title'] = df['Title'].replace(['Mlle', 'Ms'], 'Miss')
df['Title'] = df['Title'].replace(['Mme'], 'Mrs')

rare_titles = ['Dr', 'Rev', 'Col', 'Major', 'Countess', 'Lady', 'Jonkheer', 'Don', 'Dona', 'Capt', 'Sir']
for title in rare_titles:
    df['Title'] = df['Title'].replace(title, 'Rare')

In [9]:
# Find median age for each Title
title_ages = df.groupby('Title')['Age'].median()

# Fill missing Age using median age for each Title
for title, age in title_ages.items():
    df.loc[(df['Age'].isnull()) & (df['Title'] == title), 'Age'] = age

In [10]:
print(df.groupby('Title')['Survived'].mean())

Title
Master          0.575000
Miss            0.702703
Mr              0.156673
Mrs             0.793651
Rare            0.318182
the Countess    1.000000
Name: Survived, dtype: float64

In [11]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
Title            0
dtype: int64